#### Terraform Plan `success`

<details><summary>Show plan</summary>

```
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s [id=2749251940]
data.cloudflare_zone.main: Read complete after 1s [id=d6d3d7657a16a8f5650abce88f4ce603]
cloudflare_record.mx_2: Refreshing state... [id=fc8bb2e00bbea5c0af0a875026628683]
cloudflare_record.dkim_fm1: Refreshing state... [id=f448b309931fd44981db0dcff1736dad]
cloudflare_record.google_verification: Refreshing state... [id=5eb495f66f25e2a4e19412c33cf2b681]
cloudflare_record.lhr2_wildcard: Refreshing state... [id=50ba09f7439412eb0659d61c35e1754d]
cloudflare_record.dkim_fm2: Refreshing state... [id=5f6bf537b0341ec95c5260ab2762cb58]
cloudflare_record.dmarc: Refreshing state... [id=e4713053f2ebda61e3b1ccaea143cc77]
cloudflare_record.dkim_fm3: Refreshing state... [id=d9a71ded6306e51ffb11b80da0ecc8b5]
cloudflare_record.spf: Refreshing state... [id=021d305ece5fc6b062c83ad9c09ccd9c]
cloudflare_record.lhr2: Refreshing state... [id=b0b0e73af2b22612342b4658976a85b3]
cloudflare_record.lhr2_aaaa: Refreshing state... [id=0dae59252d3a08acefd24564cc191349]
cloudflare_record.mx_1: Refreshing state... [id=4ab9a3ec39f3eca0eda1e948a417152b]
cloudflare_record.www: Refreshing state... [id=13a02ea8fb89f8355e74d788ee0b9940]
cloudflare_record.lhr2_wildcard_aaaa: Refreshing state... [id=8c4c66126b29554ced869e83e7048bd4]
google_project_service.cloudresourcemanager: Refreshing state... [id=simonandrews-ca-terraform/cloudresourcemanager.googleapis.com]
google_project_service.cloudbuild: Refreshing state... [id=simonandrews-ca-terraform/cloudbuild.googleapis.com]
google_project_service.compute: Refreshing state... [id=simonandrews-ca-terraform/compute.googleapis.com]
google_project_service.certificatemanager: Refreshing state... [id=simonandrews-ca-terraform/certificatemanager.googleapis.com]
google_project_service.iam: Refreshing state... [id=simonandrews-ca-terraform/iam.googleapis.com]
google_compute_security_policy.cloudflare_only: Refreshing state... [id=projects/simonandrews-ca-terraform/global/securityPolicies/simonandrews-ca-cloudflare-only]
google_compute_url_map.http_redirect: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-http-redirect]
google_project_service.artifactregistry: Refreshing state... [id=simonandrews-ca-terraform/artifactregistry.googleapis.com]
google_project_service.run: Refreshing state... [id=simonandrews-ca-terraform/run.googleapis.com]
google_compute_target_http_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpProxies/simonandrews-ca-http-proxy]
google_certificate_manager_dns_authorization.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/dnsAuthorizations/simonandrews-ca-auth]
google_artifact_registry_repository.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/repositories/simonandrews-ca]
google_compute_global_address.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/addresses/simonandrews-ca-ip]
google_certificate_manager_certificate_map.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map]
google_service_account.cloud_build: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions]
google_service_account.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.terraform: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloud_run_v2_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca]
cloudflare_record.apex_a: Refreshing state... [id=c3c7d6f96a1b951584d5bb805ebc2b61]
google_compute_global_forwarding_rule.http: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-http]
google_project_iam_member.terraform_sa["roles/compute.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/certificatemanager.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/certificatemanager.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/artifactregistry.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/storage.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/storage.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.integrations.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.integrations.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/compute.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.builds.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.builds.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountUser"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/run.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.main: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/4efc2732-2d98-4855-9ba3-c34c87091264]
google_project_iam_member.cloud_build_run_admin: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.preview: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/43fb9c95-9879-40fc-8df1-1f8ef0970203]
google_project_iam_member.cloud_build_artifact_registry: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.writer/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_log_writer: Refreshing state... [id=simonandrews-ca-terraform/roles/logging.logWriter/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_sa_user: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions/providers/github-actions]
google_service_account_iam_member.terraform_wif: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68732768207/locations/global/workloadIdentityPools/github-actions/attribute.repository/simon360/simonandrews.ca]
google_certificate_manager_certificate.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificates/simonandrews-ca-cert]
cloudflare_record.cert_auth: Refreshing state... [id=75d72dd4d2271495e4fa328336f41ca5]
google_compute_region_network_endpoint_group.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/regions/europe-west1/networkEndpointGroups/simonandrews-ca-neg]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca/roles/run.invoker/allUsers]
google_certificate_manager_certificate_map_entry.wildcard: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map/certificateMapEntries/simonandrews-ca-wildcard]
google_certificate_manager_certificate_map_entry.apex: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map/certificateMapEntries/simonandrews-ca-apex]
google_compute_backend_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/backendServices/simonandrews-ca-backend]
google_compute_url_map.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-url-map]
google_compute_target_https_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpsProxies/simonandrews-ca-https-proxy]
google_compute_global_forwarding_rule.https: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-https]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.components will be created
  + resource "cloudflare_record" "components" {
      + allow_overwrite = false
      + content         = "34.120.6.169"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "components"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "d6d3d7657a16a8f5650abce88f4ce603"
    }

  # google_cloud_run_v2_service.storybook will be created
  + resource "google_cloud_run_v2_service" "storybook" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "simonandrews-ca-storybook"
      + observed_generation     = (known after apply)
      + project                 = "simonandrews-ca-terraform"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {
          + manual_instance_count = 0
          + min_instance_count    = 0
        }

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello:latest"

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # google_cloud_run_v2_service_iam_member.storybook_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "storybook_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + name     = "simonandrews-ca-storybook"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # google_cloudbuild_trigger.storybook will be created
  + resource "google_cloudbuild_trigger" "storybook" {
      + create_time     = (known after apply)
      + description     = "Build and deploy Storybook to Cloud Run on push to main"
      + filename        = "cloudbuild-storybook.yaml"
      + id              = (known after apply)
      + location        = "global"
      + name            = "simonandrews-ca-storybook"
      + project         = "simonandrews-ca-terraform"
      + service_account = "projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com"
      + substitutions   = {
          + "_REGION"          = "europe-west1"
          + "_REPOSITORY_NAME" = "simonandrews-ca"
          + "_SERVICE_NAME"    = "simonandrews-ca"
        }
      + trigger_id      = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "simonandrews.ca"
          + owner = "simon360"

          + push {
              + branch = "^main$"
            }
        }
    }

  # google_compute_backend_service.storybook will be created
  + resource "google_compute_backend_service" "storybook" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "simonandrews-ca-storybook-backend"
      + port_name                       = (known after apply)
      + project                         = "simonandrews-ca-terraform"
      + protocol                        = (known after apply)
      + security_policy                 = "projects/simonandrews-ca-terraform/global/securityPolicies/simonandrews-ca-cloudflare-only"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config (known after apply)
    }

  # google_compute_region_network_endpoint_group.storybook will be created
  + resource "google_compute_region_network_endpoint_group" "storybook" {
      + id                    = (known after apply)
      + name                  = "simonandrews-ca-storybook-neg"
      + network_endpoint_type = "SERVERLESS"
      + project               = "simonandrews-ca-terraform"
      + region                = "europe-west1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "simonandrews-ca-storybook"
        }

      + psc_data (known after apply)
    }

  # google_compute_url_map.main will be updated in-place
  ~ resource "google_compute_url_map" "main" {
        id                 = "projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-url-map"
        name               = "simonandrews-ca-url-map"
        # (7 unchanged attributes hidden)

      + host_rule {
          + hosts        = [
              + "components.simonandrews.ca",
            ]
          + path_matcher = "storybook-paths"
            # (1 unchanged attribute hidden)
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "storybook-paths"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>